%--DATABASE--
ifather('Алексей Куликов', 'nobody').
ifather('Алексей Смирнов', 'Сергей Смирнов').
ifather('Алексей Федорович Куликов', 'nobody').
ifather('Александр Исаев', 'Елена Исаева').
ifather('Василий Исаев', 'Александр Исаев').
ifather('Владимир Куликов', 'Алексей Куликов').
ifather('Иван Крупин', 'Нина Крупина').
ifather('Иван Крупин', 'Римма Крупина').
ifather('Иван Куликов', 'Владимир Куликов').
ifather('Иван Куликов', 'Елена Куликова').
ifather('Николай Смирнов', 'nobody').
ifather('Николай Тимофеев', 'Вера Тимофеева').
ifather('Николай Тимофеев', 'Мария Тимофеева').
ifather('Петр Смирнов', 'Алексей Смирнов').
ifather('Петр Смирнов', 'Галина Смирнова').
ifather('Петр Смирнов', 'Николай Смирнов').
ifather('Сергей Смирнов', 'nobody').
ifather('Федор Куликов', 'Алексей Федорович Куликов').
ifather('Федор Куликов', 'Иван Куликов').
imother('Александра Романова', 'Нина Крупина').
imother('Александра Романова', 'Римма Крупина').
imother('Анна Никифорова', 'Александр Исаев').
imother('Вера Тимофеева', 'nobody').
imother('Галина Смирнова', 'nobody').
imother('Дарья Лукина', 'Вера Тимофеева').
imother('Дарья Лукина', 'Мария Тимофеева').
imother('Евгения Трошина', 'Алексей Федорович Куликов').
imother('Евгения Трошина', 'Иван Куликов').
imother('Елена Исаева', 'Алексей Куликов').
imother('Елена Куликова', 'nobody').
imother('Мария Тимофеева', 'Елена Исаева').
imother('Наталья Смирнова', 'Сергей Смирнов').
imother('Нина Крупина', 'Алексей Смирнов').
imother('Нина Крупина', 'Галина Смирнова').
imother('Нина Крупина', 'Николай Смирнов').
imother('Римма Крупина', 'Владимир Куликов').
imother('Римма Крупина', 'Елена Куликова').